mule-soap-performance/target/classes/AddEntryRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:csv="http://www.wscomposition.org/CSVFile/">
   <soapenv:Header/>
   <soapenv:Body>
      <csv:AddEntryRequest>
         <key></key>
         <value></value>
         <path></path>
      </csv:AddEntryRequest>
   </soapenv:Body>
</soapenv:Envelope>